tap "homebrew/cask"
tap "homebrew/cask-fonts"


brew "node@18"
brew "neovim"
brew "fish"
brew "mas"
brew "curl"
brew "cmake"
brew "elixir"
brew "go"
brew "fzf"
brew "bat"
brew "gh"
brew "htop"
brew "ios-deploy"
brew "julia"
brew "kotlin"
brew "llvm"
brew "ncurses"
brew "protobuf"
brew "ruby-build"
brew "rbenv"
brew "rustscan"
brew "zstd"
brew "zoxide"
brew "gcc"
brew "openssl"
brew "postgresql@14"
brew "tinygo"
brew "tree"
brew "tree-sitter"
brew "imagemagick"
brew "fastfetch"
brew "jq"


cask "kitty"
cask "brave-browser"
cask "ipfs"
cask "raspberry-pi-imager"
cask "neovide"
cask "webtorrent"
cask "vscodium"
cask "imhex"
cask "emacs"
cask "font-jetbrains-mono"
cask "clion"
cask "goland"
cask "intellij-idea"

mas "ICE Buddy", id: 1595947689
mas "Bitwarden", id: 1352778147
mas "Xcode", id: 497799835
mas "DaisyDisk", id: 411643860
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Magnet", id: 441258766
mas "Pages", id: 409201541
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "WhatsApp Desktop", id: 1147396723
